zephyrproject-rtos/hal_gigadevice/include/dt-bindings/pinctrl/gd32c103r(b-8)xx-pinctrl.h
/* I2C0_TXFRAME */
#define I2C0_TXFRAME_PB4 \
	GD32_PINMUX_AFIO('B', 4, ALTERNATE, NORMP)

/* I2C1_SCL */
#define I2C1_SCL_PB10 \
	GD32_PINMUX_AFIO('B', 10, ALTERNATE, NORMP)

/* I2C1_SDA */
#define I2C1_SDA_PB11 \
	GD32_PINMUX_AFIO('B', 11, ALTERNATE, NORMP)

/* I2C1_SMBA */
#define I2C1_SMBA_PB12 \
	GD32_PINMUX_AFIO('B', 12, ALTERNATE, NORMP)

/* I2C1_TXFRAME */
#define I2C1_TXFRAME_PB13 \
	GD32_PINMUX_AFIO('B', 13, ALTERNATE, NORMP)

/* I2S1_CK */
#define I2S1_CK_PB13 \
	GD32_PINMUX_AFIO('B', 13, ALTERNATE, NORMP)

/* I2S1_MCK */
#define I2S1_MCK_PC6 \
	GD32_PINMUX_AFIO('C', 6, ALTERNATE, NORMP)

/* I2S1_SD */
#define I2S1_SD_PB15_INP \
	GD32_PINMUX_AFIO('B', 15, GPIO_IN, NORMP)
#define I2S1_SD_PB15_OUT \
	GD32_PINMUX_AFIO('B', 15, ALTERNATE, NORMP)

/* I2S1_WS */
#define I2S1_WS_PB12_INP \
	GD32_PINMUX_AFIO('B', 12, GPIO_IN, NORMP)
#define I2S1_WS_PB12_OUT \
	GD32_PINMUX_AFIO('B', 12, ALTERNATE, NORMP)

/* I2S2_CK */
#define I2S2_CK_PB3_NORMP \
	GD32_PINMUX_AFIO('B', 3, ALTERNATE, I2S2_NORMP)
#define I2S2_CK_PC10_RMP \
	GD32_PINMUX_AFIO('C', 10, ALTERNATE, I2S2_RMP)

/* I2S2_MCK */
#define I2S2_MCK_PC7 \
	GD32_PINMUX_AFIO('C', 7, ALTERNATE, NORMP)

/* I2S2_SD */
#define I2S2_SD_PB5_INP_NORMP \
	GD32_PINMUX_AFIO('B', 5, GPIO_IN, I2S2_NORMP)
#define I2S2_SD_PB5_OUT_NORMP \
	GD32_PINMUX_AFIO('B', 5, ALTERNATE, I2S2_NORMP)
#define I2S2_SD_PC12_INP_RMP \
	GD32_PINMUX_AFIO('C', 12, GPIO_IN, I2S2_RMP)
#define I2S2_SD_PC12_OUT_RMP \
	GD32_PINMUX_AFIO('C', 12, ALTERNATE, I2S2_RMP)

/* I2S2_WS */
#define I2S2_WS_PA15_INP_NORMP \
	GD32_PINMUX_AFIO('A', 15, GPIO_IN, I2S2_NORMP)
#define I2S2_WS_PA15_OUT_NORMP \
	GD32_PINMUX_AFIO('A', 15, ALTERNATE, I2S2_NORMP)
#define I2S2_WS_PA4_INP_RMP \
	GD32_PINMUX_AFIO('A', 4, GPIO_IN, I2S2_RMP)
#define I2S2_WS_PA4_OUT_RMP \
	GD32_PINMUX_AFIO('A', 4, ALTERNATE, I2S2_RMP)

/* RTC_TAMPER */
#define RTC_TAMPER_PC13 \
	GD32_PINMUX_AFIO('C', 13, GPIO_IN, NORMP)

/* SPI0_IO2 */
#define SPI0_IO2_PA2_NORMP \
	GD32_PINMUX_AFIO('A', 2, ALTERNATE, SPI0_NORMP)
#define SPI0_IO2_PB6_RMP \
	GD32_PINMUX_AFIO('B', 6, ALTERNATE, SPI0_RMP)

/* SPI0_IO3 */
#define SPI0_IO3_PA3_NORMP \
	GD32_PINMUX_AFIO('A', 3, ALTERNATE, SPI0_NORMP)
#define SPI0_IO3_PB7_RMP \
	GD32_PINMUX_AFIO('B', 7, ALTERNATE, SPI0_RMP)

/* SPI0_MISO */
#define SPI0_MISO_PA6_INP_NORMP \
	GD32_PINMUX_AFIO('A', 6, GPIO_IN, SPI0_NORMP)
#define SPI0_MISO_PA6_OUT_NORMP \
	GD32_PINMUX_AFIO('A', 6, ALTERNATE, SPI0_NORMP)
#define SPI0_MISO_PB4_INP_RMP \
	GD32_PINMUX_AFIO('B', 4, GPIO_IN, SPI0_RMP)
#define SPI0_MISO_PB4_OUT_RMP \
	GD32_PINMUX_AFIO('B', 4, ALTERNATE, SPI0_RMP)

/* SPI0_MOSI */
#define SPI0_MOSI_PA7_INP_NORMP \
	GD32_PINMUX_AFIO('A', 7, GPIO_IN, SPI0_NORMP)
#define SPI0_MOSI_PA7_OUT_NORMP \
	GD32_PINMUX_AFIO('A', 7, ALTERNATE, SPI0_NORMP)
#define SPI0_MOSI_PB5_INP_RMP \
	GD32_PINMUX_AFIO('B', 5, GPIO_IN, SPI0_RMP)
#define SPI0_MOSI_PB5_OUT_RMP \
	GD32_PINMUX_AFIO('B', 5, ALTERNATE, SPI0_RMP)

/* SPI0_NSS */
#define SPI0_NSS_PA4_INP_NORMP \
	GD32_PINMUX_AFIO('A', 4, GPIO_IN, SPI0_NORMP)
#define SPI0_NSS_PA4_OUT_NORMP \
	GD32_PINMUX_AFIO('A', 4, ALTERNATE, SPI0_NORMP)
#define SPI0_NSS_PA15_INP_RMP \
	GD32_PINMUX_AFIO('A', 15, GPIO_IN, SPI0_RMP)
#define SPI0_NSS_PA15_OUT_RMP \
	GD32_PINMUX_AFIO('A', 15, ALTERNATE, SPI0_RMP)

/* SPI0_SCK */
#define SPI0_SCK_PA5_INP_NORMP \
	GD32_PINMUX_AFIO('A', 5, GPIO_IN, SPI0_NORMP)
#define SPI0_SCK_PA5_OUT_NORMP \
	GD32_PINMUX_AFIO('A', 5, ALTERNATE, SPI0_NORMP)
#define SPI0_SCK_PB3_INP_RMP \
	GD32_PINMUX_AFIO('B', 3, GPIO_IN, SPI0_RMP)
#define SPI0_SCK_PB3_OUT_RMP \
	GD32_PINMUX_AFIO('B', 3, ALTERNATE, SPI0_RMP)

/* SPI1_MISO */
#define SPI1_MISO_PB14_INP \
	GD32_PINMUX_AFIO('B', 14, GPIO_IN, NORMP)
#define SPI1_MISO_PB14_OUT \
	GD32_PINMUX_AFIO('B', 14, ALTERNATE, NORMP)

/* SPI1_MOSI */
#define SPI1_MOSI_PB15_INP \
	GD32_PINMUX_AFIO('B', 15, GPIO_IN, NORMP)
#define SPI1_MOSI_PB15_OUT \
	GD32_PINMUX_AFIO('B', 15, ALTERNATE, NORMP)

/* SPI1_NSS */
#define SPI1_NSS_PB12_INP \
	GD32_PINMUX_AFIO('B', 12, GPIO_IN, NORMP)
#define SPI1_NSS_PB12_OUT \
	GD32_PINMUX_AFIO('B', 12, ALTERNATE, NORMP)

/* SPI1_SCK */
#define SPI1_SCK_PB13_INP \
	GD32_PINMUX_AFIO('B', 13, GPIO_IN, NORMP)
#define SPI1_SCK_PB13_OUT \
	GD32_PINMUX_AFIO('B', 13, ALTERNATE, NORMP)

/* SPI2_MISO */
#define SPI2_MISO_PB4_INP_NORMP \
	GD32_PINMUX_AFIO('B', 4, GPIO_IN, SPI2_NORMP)
#define SPI2_MISO_PB4_OUT_NORMP \
	GD32_PINMUX_AFIO('B', 4, ALTERNATE, SPI2_NORMP)
#define SPI2_MISO_PC11_INP_RMP \
	GD32_PINMUX_AFIO('C', 11, GPIO_IN, SPI2_RMP)
#define SPI2_MISO_PC11_OUT_RMP \
	GD32_PINMUX_AFIO('C', 11, ALTERNATE, SPI2_RMP)

/* SPI2_MOSI */
#define SPI2_MOSI_PB5_INP_NORMP \
	GD32_PINMUX_AFIO('B', 5, GPIO_IN, SPI2_NORMP)
#define SPI2_MOSI_PB5_OUT_NORMP \
	GD32_PINMUX_AFIO('B', 5, ALTERNATE, SPI2_NORMP)
#define SPI2_MOSI_PC12_INP_RMP \
	GD32_PINMUX_AFIO('C', 12, GPIO_IN, SPI2_RMP)
#define SPI2_MOSI_PC12_OUT_RMP \
	GD32_PINMUX_AFIO('C', 12, ALTERNATE, SPI2_RMP)

/* SPI2_NSS */
#define SPI2_NSS_PA15_INP_NORMP \
	GD32_PINMUX_AFIO('A', 15, GPIO_IN, SPI2_NORMP)
#define SPI2_NSS_PA15_OUT_NORMP \
	GD32_PINMUX_AFIO('A', 15, ALTERNATE, SPI2_NORMP)
#define SPI2_NSS_PA4_INP_RMP \
	GD32_PINMUX_AFIO('A', 4, GPIO_IN, SPI2_RMP)
#define SPI2_NSS_PA4_OUT_RMP \
	GD32_PINMUX_AFIO('A', 4, ALTERNATE, SPI2_RMP)

/* SPI2_SCK */
#define SPI2_SCK_PB3_INP_NORMP \
	GD32_PINMUX_AFIO('B', 3, GPIO_IN, SPI2_NORMP)
#define SPI2_SCK_PB3_OUT_NORMP \
	GD32_PINMUX_AFIO('B', 3, ALTERNATE, SPI2_NORMP)
#define SPI2_SCK_PC10_INP_RMP \
	GD32_PINMUX_AFIO('C', 10, GPIO_IN, SPI2_RMP)
#define SPI2_SCK_PC10_OUT_RMP \
	GD32_PINMUX_AFIO('C', 10, ALTERNATE, SPI2_RMP)

/* TIMER0_BKIN */
#define TIMER0_BKIN_PB12_NORMP \
	GD32_PINMUX_AFIO('B', 12, GPIO_IN, TIMER0_NORMP)
#define TIMER0_BKIN_PA6_PRMP \
	GD32_PINMUX_AFIO('A', 6, GPIO_IN, TIMER0_PRMP)

/* TIMER0_CH0 */
#define TIMER0_CH0_PA8_INP_NORMP \
	GD32_PINMUX_AFIO('A', 8, GPIO_IN, TIMER0_NORMP)
#define TIMER0_CH0_PA8_OUT_NORMP \
	GD32_PINMUX_AFIO('A', 8, ALTERNATE, TIMER0_NORMP)
#define TIMER0_CH0_PA8_INP_PRMP \
	GD32_PINMUX_AFIO('A', 8, GPIO_IN, TIMER0_PRMP)
#define TIMER0_CH0_PA8_OUT_PRMP \
	GD32_PINMUX_AFIO('A', 8, ALTERNATE, TIMER0_PRMP)

