zephyrproject-rtos/hal_gigadevice/include/dt-bindings/pinctrl/gd32c103r(b-8)xx-pinctrl.h
/* TIMER0_CH0_ON */
#define TIMER0_CH0_ON_PB13_INP_NORMP \
	GD32_PINMUX_AFIO('B', 13, GPIO_IN, TIMER0_NORMP)
#define TIMER0_CH0_ON_PB13_OUT_NORMP \
	GD32_PINMUX_AFIO('B', 13, ALTERNATE, TIMER0_NORMP)
#define TIMER0_CH0_ON_PA7_INP_PRMP \
	GD32_PINMUX_AFIO('A', 7, GPIO_IN, TIMER0_PRMP)
#define TIMER0_CH0_ON_PA7_OUT_PRMP \
	GD32_PINMUX_AFIO('A', 7, ALTERNATE, TIMER0_PRMP)

/* TIMER0_CH1 */
#define TIMER0_CH1_PA9_INP_NORMP \
	GD32_PINMUX_AFIO('A', 9, GPIO_IN, TIMER0_NORMP)
#define TIMER0_CH1_PA9_OUT_NORMP \
	GD32_PINMUX_AFIO('A', 9, ALTERNATE, TIMER0_NORMP)
#define TIMER0_CH1_PA9_INP_PRMP \
	GD32_PINMUX_AFIO('A', 9, GPIO_IN, TIMER0_PRMP)
#define TIMER0_CH1_PA9_OUT_PRMP \
	GD32_PINMUX_AFIO('A', 9, ALTERNATE, TIMER0_PRMP)

/* TIMER0_CH1_ON */
#define TIMER0_CH1_ON_PB14_INP_NORMP \
	GD32_PINMUX_AFIO('B', 14, GPIO_IN, TIMER0_NORMP)
#define TIMER0_CH1_ON_PB14_OUT_NORMP \
	GD32_PINMUX_AFIO('B', 14, ALTERNATE, TIMER0_NORMP)
#define TIMER0_CH1_ON_PB0_INP_PRMP \
	GD32_PINMUX_AFIO('B', 0, GPIO_IN, TIMER0_PRMP)
#define TIMER0_CH1_ON_PB0_OUT_PRMP \
	GD32_PINMUX_AFIO('B', 0, ALTERNATE, TIMER0_PRMP)

/* TIMER0_CH2 */
#define TIMER0_CH2_PA10_INP_NORMP \
	GD32_PINMUX_AFIO('A', 10, GPIO_IN, TIMER0_NORMP)
#define TIMER0_CH2_PA10_OUT_NORMP \
	GD32_PINMUX_AFIO('A', 10, ALTERNATE, TIMER0_NORMP)
#define TIMER0_CH2_PA10_INP_PRMP \
	GD32_PINMUX_AFIO('A', 10, GPIO_IN, TIMER0_PRMP)
#define TIMER0_CH2_PA10_OUT_PRMP \
	GD32_PINMUX_AFIO('A', 10, ALTERNATE, TIMER0_PRMP)

/* TIMER0_CH2_ON */
#define TIMER0_CH2_ON_PB15_NORMP \
	GD32_PINMUX_AFIO('B', 15, ALTERNATE, TIMER0_NORMP)
#define TIMER0_CH2_ON_PB1_PRMP \
	GD32_PINMUX_AFIO('B', 1, ALTERNATE, TIMER0_PRMP)

/* TIMER0_CH3 */
#define TIMER0_CH3_PA11_INP_NORMP \
	GD32_PINMUX_AFIO('A', 11, GPIO_IN, TIMER0_NORMP)
#define TIMER0_CH3_PA11_OUT_NORMP \
	GD32_PINMUX_AFIO('A', 11, ALTERNATE, TIMER0_NORMP)
#define TIMER0_CH3_PA11_INP_PRMP \
	GD32_PINMUX_AFIO('A', 11, GPIO_IN, TIMER0_PRMP)
#define TIMER0_CH3_PA11_OUT_PRMP \
	GD32_PINMUX_AFIO('A', 11, ALTERNATE, TIMER0_PRMP)

/* TIMER0_ETI */
#define TIMER0_ETI_PA12_NORMP \
	GD32_PINMUX_AFIO('A', 12, GPIO_IN, TIMER0_NORMP)
#define TIMER0_ETI_PA12_PRMP \
	GD32_PINMUX_AFIO('A', 12, GPIO_IN, TIMER0_PRMP)

/* TIMER10_CH0 */
#define TIMER10_CH0_PB9_INP \
	GD32_PINMUX_AFIO('B', 9, GPIO_IN, NORMP)
#define TIMER10_CH0_PB9_OUT \
	GD32_PINMUX_AFIO('B', 9, ALTERNATE, NORMP)

/* TIMER11_CH0 */
#define TIMER11_CH0_PB14_INP \
	GD32_PINMUX_AFIO('B', 14, GPIO_IN, NORMP)
#define TIMER11_CH0_PB14_OUT \
	GD32_PINMUX_AFIO('B', 14, ALTERNATE, NORMP)

/* TIMER11_CH11 */
#define TIMER11_CH11_PB15_INP \
	GD32_PINMUX_AFIO('B', 15, GPIO_IN, NORMP)
#define TIMER11_CH11_PB15_OUT \
	GD32_PINMUX_AFIO('B', 15, ALTERNATE, NORMP)

/* TIMER12_CH0 */
#define TIMER12_CH0_PA6_INP \
	GD32_PINMUX_AFIO('A', 6, GPIO_IN, NORMP)
#define TIMER12_CH0_PA6_OUT \
	GD32_PINMUX_AFIO('A', 6, ALTERNATE, NORMP)

/* TIMER13_CH0 */
#define TIMER13_CH0_PA7_INP \
	GD32_PINMUX_AFIO('A', 7, GPIO_IN, NORMP)
#define TIMER13_CH0_PA7_OUT \
	GD32_PINMUX_AFIO('A', 7, ALTERNATE, NORMP)

/* TIMER1_CH0_ETI */
#define TIMER1_CH0_ETI_PA0 \
	GD32_PINMUX_AFIO('A', 0, GPIO_IN, NORMP)

/* TIMER1_CH1 */
#define TIMER1_CH1_PA1_INP_NORMP \
	GD32_PINMUX_AFIO('A', 1, GPIO_IN, TIMER1_NORMP)
#define TIMER1_CH1_PA1_OUT_NORMP \
	GD32_PINMUX_AFIO('A', 1, ALTERNATE, TIMER1_NORMP)
#define TIMER1_CH1_PA1_INP_PRMP2 \
	GD32_PINMUX_AFIO('A', 1, GPIO_IN, TIMER1_PRMP2)
#define TIMER1_CH1_PA1_OUT_PRMP2 \
	GD32_PINMUX_AFIO('A', 1, ALTERNATE, TIMER1_PRMP2)
#define TIMER1_CH1_PB3_INP_PRMP1 \
	GD32_PINMUX_AFIO('B', 3, GPIO_IN, TIMER1_PRMP1)
#define TIMER1_CH1_PB3_OUT_PRMP1 \
	GD32_PINMUX_AFIO('B', 3, ALTERNATE, TIMER1_PRMP1)
#define TIMER1_CH1_PB3_INP_FRMP \
	GD32_PINMUX_AFIO('B', 3, GPIO_IN, TIMER1_FRMP)
#define TIMER1_CH1_PB3_OUT_FRMP \
	GD32_PINMUX_AFIO('B', 3, ALTERNATE, TIMER1_FRMP)

/* TIMER1_CH2 */
#define TIMER1_CH2_PA2_INP_NORMP \
	GD32_PINMUX_AFIO('A', 2, GPIO_IN, TIMER1_NORMP)
#define TIMER1_CH2_PA2_OUT_NORMP \
	GD32_PINMUX_AFIO('A', 2, ALTERNATE, TIMER1_NORMP)
#define TIMER1_CH2_PA2_INP_PRMP1 \
	GD32_PINMUX_AFIO('A', 2, GPIO_IN, TIMER1_PRMP1)
#define TIMER1_CH2_PA2_OUT_PRMP1 \
	GD32_PINMUX_AFIO('A', 2, ALTERNATE, TIMER1_PRMP1)
#define TIMER1_CH2_PB10_INP_PRMP2 \
	GD32_PINMUX_AFIO('B', 10, GPIO_IN, TIMER1_PRMP2)
#define TIMER1_CH2_PB10_OUT_PRMP2 \
	GD32_PINMUX_AFIO('B', 10, ALTERNATE, TIMER1_PRMP2)
#define TIMER1_CH2_PB10_INP_FRMP \
	GD32_PINMUX_AFIO('B', 10, GPIO_IN, TIMER1_FRMP)
#define TIMER1_CH2_PB10_OUT_FRMP \
	GD32_PINMUX_AFIO('B', 10, ALTERNATE, TIMER1_FRMP)

/* TIMER1_CH3 */
#define TIMER1_CH3_PA3_INP_NORMP \
	GD32_PINMUX_AFIO('A', 3, GPIO_IN, TIMER1_NORMP)
#define TIMER1_CH3_PA3_OUT_NORMP \
	GD32_PINMUX_AFIO('A', 3, ALTERNATE, TIMER1_NORMP)
#define TIMER1_CH3_PA3_INP_PRMP1 \
	GD32_PINMUX_AFIO('A', 3, GPIO_IN, TIMER1_PRMP1)
#define TIMER1_CH3_PA3_OUT_PRMP1 \
	GD32_PINMUX_AFIO('A', 3, ALTERNATE, TIMER1_PRMP1)
#define TIMER1_CH3_PB11_INP_PRMP2 \
	GD32_PINMUX_AFIO('B', 11, GPIO_IN, TIMER1_PRMP2)
#define TIMER1_CH3_PB11_OUT_PRMP2 \
	GD32_PINMUX_AFIO('B', 11, ALTERNATE, TIMER1_PRMP2)
#define TIMER1_CH3_PB11_INP_FRMP \
	GD32_PINMUX_AFIO('B', 11, GPIO_IN, TIMER1_FRMP)
#define TIMER1_CH3_PB11_OUT_FRMP \
	GD32_PINMUX_AFIO('B', 11, ALTERNATE, TIMER1_FRMP)

/* TIMER2_CH0 */
#define TIMER2_CH0_PA6_INP_NORMP \
	GD32_PINMUX_AFIO('A', 6, GPIO_IN, TIMER2_NORMP)
#define TIMER2_CH0_PA6_OUT_NORMP \
	GD32_PINMUX_AFIO('A', 6, ALTERNATE, TIMER2_NORMP)
#define TIMER2_CH0_PB4_INP_PRMP \
	GD32_PINMUX_AFIO('B', 4, GPIO_IN, TIMER2_PRMP)
#define TIMER2_CH0_PB4_OUT_PRMP \
	GD32_PINMUX_AFIO('B', 4, ALTERNATE, TIMER2_PRMP)
#define TIMER2_CH0_PC6_INP_FRMP \
	GD32_PINMUX_AFIO('C', 6, GPIO_IN, TIMER2_FRMP)
#define TIMER2_CH0_PC6_OUT_FRMP \
	GD32_PINMUX_AFIO('C', 6, ALTERNATE, TIMER2_FRMP)

/* TIMER2_CH1 */
#define TIMER2_CH1_PA7_INP_NORMP \
	GD32_PINMUX_AFIO('A', 7, GPIO_IN, TIMER2_NORMP)
#define TIMER2_CH1_PA7_OUT_NORMP \
	GD32_PINMUX_AFIO('A', 7, ALTERNATE, TIMER2_NORMP)
#define TIMER2_CH1_PB5_INP_PRMP \
	GD32_PINMUX_AFIO('B', 5, GPIO_IN, TIMER2_PRMP)
#define TIMER2_CH1_PB5_OUT_PRMP \
	GD32_PINMUX_AFIO('B', 5, ALTERNATE, TIMER2_PRMP)
#define TIMER2_CH1_PC7_INP_FRMP \
	GD32_PINMUX_AFIO('C', 7, GPIO_IN, TIMER2_FRMP)
#define TIMER2_CH1_PC7_OUT_FRMP \
	GD32_PINMUX_AFIO('C', 7, ALTERNATE, TIMER2_FRMP)

/* TIMER2_CH2 */
#define TIMER2_CH2_PB0_INP_NORMP \
	GD32_PINMUX_AFIO('B', 0, GPIO_IN, TIMER2_NORMP)
#define TIMER2_CH2_PB0_OUT_NORMP \
	GD32_PINMUX_AFIO('B', 0, ALTERNATE, TIMER2_NORMP)
#define TIMER2_CH2_PB0_INP_PRMP \
	GD32_PINMUX_AFIO('B', 0, GPIO_IN, TIMER2_PRMP)
#define TIMER2_CH2_PB0_OUT_PRMP \
	GD32_PINMUX_AFIO('B', 0, ALTERNATE, TIMER2_PRMP)
#define TIMER2_CH2_PC8_INP_FRMP \
	GD32_PINMUX_AFIO('C', 8, GPIO_IN, TIMER2_FRMP)
#define TIMER2_CH2_PC8_OUT_FRMP \
	GD32_PINMUX_AFIO('C', 8, ALTERNATE, TIMER2_FRMP)

/* TIMER2_CH3 */
#define TIMER2_CH3_PB1_INP_NORMP \
	GD32_PINMUX_AFIO('B', 1, GPIO_IN, TIMER2_NORMP)
#define TIMER2_CH3_PB1_OUT_NORMP \
	GD32_PINMUX_AFIO('B', 1, ALTERNATE, TIMER2_NORMP)
#define TIMER2_CH3_PB1_INP_PRMP \
	GD32_PINMUX_AFIO('B', 1, GPIO_IN, TIMER2_PRMP)
#define TIMER2_CH3_PB1_OUT_PRMP \
	GD32_PINMUX_AFIO('B', 1, ALTERNATE, TIMER2_PRMP)
#define TIMER2_CH3_PC9_INP_FRMP \
	GD32_PINMUX_AFIO('C', 9, GPIO_IN, TIMER2_FRMP)
#define TIMER2_CH3_PC9_OUT_FRMP \
	GD32_PINMUX_AFIO('C', 9, ALTERNATE, TIMER2_FRMP)

